# Create CSV
---

In [2]:
import pandas as pd
import numpy as np

---
# Sales

In [21]:
year = list(range(1990, 1998))
sale = np.array([50, 51, 52, 52, 50, 50, 49, 55])

In [26]:
Sales = pd.DataFrame({
    'year':year,
    'sale':sale
})
Sales.

dtype('int64')

In [19]:
Sales.to_csv('../../dataset/compare_between_window/Sales.csv', index=False)

## Sales2

In [27]:
year = [1990, 1992, 1993, 1994, 1997]
sale = [50, 50, 52, 55, 55]

In [28]:
Sales2 = pd.DataFrame({
    'year':year,
    'sale':sale
})
Sales2

   year  sale
0  1990    50
1  1992    50
2  1993    52
3  1994    55
4  1997    55

In [29]:
Sales2.to_csv('../../dataset/compare_between_window/Sales2.csv', index = False)

---
# Shohin

In [30]:
shohin_id = [str(e).zfill(4) for e in range(1, 9)]
shohin_id

['0001', '0002', '0003', '0004', '0005', '0006', '0007', '0008']

In [31]:
shohin_mei = ['t-shirt', 'hole-punch', 'cutter-shirt', 'kitchen-knife', 'pressure-cooker', 'fork', 'grater', 'ballpoint-pen']
shohin_mei

['t-shirt',
 'hole-punch',
 'cutter-shirt',
 'kitchen-knife',
 'pressure-cooker',
 'fork',
 'grater',
 'ballpoint-pen']

In [32]:
shohin_bunrui = ['clothes', 'office-supplies', 'clothes', 'kitchen-supplies', 'kitchen-supplies', 'kitchen-supplies', 'kitchen-supplies', 'office-supplies']
shohin_bunrui

['clothes',
 'office-supplies',
 'clothes',
 'kitchen-supplies',
 'kitchen-supplies',
 'kitchen-supplies',
 'kitchen-supplies',
 'office-supplies']

In [33]:
hanbai_tanka = [1000, 500, 4000, 3000, 6800, 500, 880, 100]
hanbai_tanka

[1000, 500, 4000, 3000, 6800, 500, 880, 100]

In [34]:
Shohin = pd.DataFrame({
    'shohin_id':shohin_id,
    'shohin_mei':shohin_mei,
    'shohin_bunrui':shohin_bunrui,
    'hanbai_tanka':hanbai_tanka
})
Shohin

  shohin_id       shohin_mei     shohin_bunrui  hanbai_tanka
0      0001          t-shirt           clothes          1000
1      0002       hole-punch   office-supplies           500
2      0003     cutter-shirt           clothes          4000
3      0004    kitchen-knife  kitchen-supplies          3000
4      0005  pressure-cooker  kitchen-supplies          6800
5      0006             fork  kitchen-supplies           500
6      0007           grater  kitchen-supplies           880
7      0008    ballpoint-pen   office-supplies           100

In [35]:
Shohin.to_csv('../../dataset/compare_between_window/Shohin.csv', index = False)

---
# Reservations

In [36]:
reserver = ['kimura', 'araki', 'hori', 'yamamoto', 'uchida', 'mizutani']
start_date = ['2018-10-26', '2018-10-28', '2018-10-31', '2018-11-03', '2018-11-03', '2018-11-06']
end_date = ['2018-10-27', '2018-10-31', '2018-11-01', '2018-11-04', '2018-11-05', '2018-11-06']

In [38]:
Reservations = pd.DataFrame({
    'reserver':reserver,
    'start_date':start_date,
    'end_date':end_date
})
Reservations

   reserver  start_date    end_date
0    kimura  2018-10-26  2018-10-27
1     araki  2018-10-28  2018-10-31
2      hori  2018-10-31  2018-11-01
3  yamamoto  2018-11-03  2018-11-04
4    uchida  2018-11-03  2018-11-05
5  mizutani  2018-11-06  2018-11-06

In [39]:
Reservations.to_csv('../../dataset/compare_between_window/Reservations.csv', index = False)

In [40]:
reserver = ['kimura', 'araki', 'hori', 'yamamoto', 'uchida', 'mizutani']
start_date2 = ['2018-10-26', '2018-10-28', '2018-10-31', '2018-11-03', '2018-11-03', '2018-11-04']
end_date = ['2018-10-27', '2018-10-31', '2018-11-01', '2018-11-04', '2018-11-05', '2018-11-06']

In [59]:
Reservations2 = pd.DataFrame({
    'reserver':reserver,
    'start_date2':start_date2,
    'end_date':end_date
})
Reservations2

   reserver start_date2    end_date
0    kimura  2018-10-26  2018-10-27
1     araki  2018-10-28  2018-10-31
2      hori  2018-10-31  2018-11-01
3  yamamoto  2018-11-03  2018-11-04
4    uchida  2018-11-03  2018-11-05
5  mizutani  2018-11-04  2018-11-06

In [60]:
Reservations2.to_csv('../../dataset/compare_between_window/Reservations2.csv', index = False)

---
# Courses

In [42]:
Courses = pd.DataFrame({
    'name':['akai','akai','suzuki','kudo','kudo','yoshida','watanabe'],
    'course':['sql-l1', 'unix-l1', 'sql-l1', 'sql-l1', 'java-l2', 'unix-l1', 'sql-l1']
})
Courses

       name   course
0      akai   sql-l1
1      akai  unix-l1
2    suzuki   sql-l1
3      kudo   sql-l1
4      kudo  java-l2
5   yoshida  unix-l1
6  watanabe   sql-l1

In [43]:
Courses.to_csv('../../dataset/compare_between_window/Courses.csv', index = False)

---
# Personnel

In [45]:
Personnel = pd.DataFrame({
    'emplyee':['akai', 'kudo', 'suzuki', 'yoshida'],
    'child_1':['ichiro', 'haruko', 'natsuko', None],
    'child_2':['jiro', 'natsuko', None, None],
    'child_3':['saburo', None, None, None]
})
Personnel

   emplyee  child_1  child_2 child_3
0     akai   ichiro     jiro  saburo
1     kudo   haruko  natsuko    None
2   suzuki  natsuko     None    None
3  yoshida     None     None    None

In [46]:
Personnel.to_csv('../../dataset/compare_between_window/Personnel.csv', index = False)

---
# TblPop

In [48]:
pref_name = ['akita']*4 + ['aomori']*3 + ['tokyo']*3 + ['chiba']*3
age_class = [1,3,1,3,1,1,3,1,1,3,1,1,3]
sex_cd = ['m' if e == 1 else 'f' for e in [1,1,0,0,1,0,0,1,0,0,1,0,0]]
population = np.array([4, 10, 8, 10, 7, 5, 8, 9, 15, 12, 9, 10, 9]) * 100

In [49]:
TblPop = pd.DataFrame({
    'pref_name':pref_name,
    'age_class':age_class,
    'sex_cd':sex_cd,
    'population':population
})
TblPop

   pref_name  age_class sex_cd  population
0      akita          1      m         400
1      akita          3      m        1000
2      akita          1      f         800
3      akita          3      f        1000
4     aomori          1      m         700
5     aomori          1      f         500
6     aomori          3      f         800
7      tokyo          1      m         900
8      tokyo          1      f        1500
9      tokyo          3      f        1200
10     chiba          1      m         900
11     chiba          1      f        1000
12     chiba          3      f         900

In [50]:
TblPop.to_csv('../../dataset/compare_between_window/TblPop.csv', index = False)

---
# Items and SalesHistory

In [51]:
Items = pd.DataFrame({
    'item_no':[10, 20, 30, 40],
    'item':['sd-card', 'cd-rom', 'usb-memory', 'dvd']
})
Items

   item_no        item
0       10     sd-card
1       20      cd-rom
2       30  usb-memory
3       40         dvd

In [53]:
SalesHistory = pd.DataFrame({
    'sale_date':['2018-10-01', '2018-10-01', '2018-10-01', '2018-10-03', '2018-10-03', '2018-10-04', '2018-10-04'],
    'item_no':[10, 20, 30, 10, 30, 20, 30],
    'quantity':[4, 10, 3, 32, 12, 22, 7]
})
SalesHistory

    sale_date  item_no  quantity
0  2018-10-01       10         4
1  2018-10-01       20        10
2  2018-10-01       30         3
3  2018-10-03       10        32
4  2018-10-03       30        12
5  2018-10-04       20        22
6  2018-10-04       30         7

In [54]:
Items.to_csv('../../dataset/compare_between_window/Items.csv', index = False)
SalesHistory.to_csv('../../dataset/compare_between_window/SalesHistory.csv', index = False)

---
# Class_A, B

In [55]:
Class_A = pd.DataFrame({
    'id':[1,2,3],
    'name':['tanaka', 'suzuki', 'ijuin']
})
Class_A

   id    name
0   1  tanaka
1   2  suzuki
2   3   ijuin

In [56]:
Class_B = pd.DataFrame({
    'id':[1,2,4],
    'name':['tanaka', 'suzuki', 'saionji']
})
Class_B

   id     name
0   1   tanaka
1   2   suzuki
2   4  saionji

In [57]:
Class_A.to_csv('../../dataset/compare_between_window/Class_A.csv', index = False)
Class_B.to_csv('../../dataset/compare_between_window/Class_B.csv', index = False)